:PROPERTIES:
:ID:       12BC5AB3-D75B-43BC-A51E-C8CD80AAE829
:header-args: :session tla :var venv="/tmp/tla" :python /tmp/tla/bin/python :async :results output
:END:
#+title: tla+

TLA+ is a modeling language to aid with [[id:04CB70C7-0644-4623-AE80-63512F671F9A][formal-verification]].

https://github.com/tlaplus/tlaplus

These are typically run within the toolbox,
docs are available here for more manual invocation:
https://lamport.azurewebsites.net/tla/standalone-tools.html?back-link=tools.html

* Babel Support

There is no evident support for TLA+ in [[id:04B03591-50E7-41E2-A2A5-0C2893FAD39C][org-babel]]...so I'll look at
throwing that together in [[id:95B942E1-D6F6-42CC-9A8F-E49F23482AB9][ob-tla]].

* Interface Selection

The standard documentation around CLI use is fairly minimal on top of
invoking [[id:72258C97-F88E-4498-825D-A7447EC008AA][java]] which is likely to get cumbersome. Beyond that
the core tools are stitched together with some files in fairly simpler
formats, but the toolbox is typically expected to manage those files.

There seem to be two provided wrappers to support CLI use.

** https://github.com/pmer/tla-bin
This is a very thin wrapper which uses the [[id:3368C2A8-C34F-45C2-8601-1735BD712D74][shell]] to absorb the Java
invocation, but this doesn't seem to address the other configuration needs.

** https://github.com/hwayne/tlacli
Is a [[id:002B2928-C32F-49F3-B93F-CBEEE215A7D7][python]] wrapper created by an author of one of the TLA+ books.
It has the advantages that it does handle some of the configuration
needs, and that it's python presumably makes it easier to wire up as a
[[id:9D4EC4DC-FC1D-430D-B834-CB0916949915][langchain]] tool.

This library is older and currently also pulls in pkg_resources which
been removed in newer versions of python setuptools. Given that the
library is fairly small and comes with a prominent disclaimer
regarding limited use, I'll tentantively plan on extracting the core
pieces here.

* Installation

Installation of TLA+ itself is currently absent but is provided by the
tla-bin installation instructions. I'll have to retrofit this when it
is encountered.

#+begin_src shell :session setup-venv
  python -m venv ${venv}
  ${venv}/bin/python -m pip install tlacli "setuptools<82"
#+end_src

#+RESULTS:
#+begin_example
venv='/tmp/tla'
python -m venv ${venv}
${venv}/bin/python -m pip install tlacli "setuptools<82"
Requirement already satisfied: tlacli in /private/tmp/tla/lib/python3.14/site-packages (0.0.1)
Collecting setuptools<82
  Using cached setuptools-81.0.0-py3-none-any.whl.metadata (6.6 kB)
Using cached setuptools-81.0.0-py3-none-any.whl (1.1 MB)
Installing collected packages: setuptools
  Attempting uninstall: setuptools
    Found existing installation: setuptools 82.0.1
    Uninstalling setuptools-82.0.1:
      Successfully uninstalled setuptools-82.0.1
Successfully installed setuptools-81.0.0

[notice] A new release of pip is available: 26.1.1 -> 26.1.2
[notice] To update, run: /private/tmp/tla/bin/python -m pip install --upgrade pip
[?2004hecho 'ob_comint_async_shell_end_64989235-1e2c-414b-a8c8-00ff29ea50f2'[?2004l
#+end_example

#+begin_src shell
  . ${venv}/bin/activate
  tlacli --help
#+end_src

#+RESULTS:
#+begin_example
(tla) org_babel_sh_prompt> venv='/tmp/tla'
(tla) org_babel_sh_prompt> . ${venv}/bin/activate
(tla) org_babel_sh_prompt> tlacli --help
/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename
usage: tlacli [-h] {check,tlc,translate,pc,pluscal} ...

positional arguments:
  {check,tlc,translate,pc,pluscal}
                        Which TLA+ tool to run
    check (tlc)         Run the TLC model checker on a TLA+ spec.
    translate (pc, pluscal)
                        Translate pluscal into TLA+

options:
  -h, --help            show this help message and exit
(tla) org_babel_sh_prompt> [?2004hecho 'ob_comint_async_shell_end_ca41b204-160a-45ec-9ae4-4e7bd2bc5473'[?2004l
#+end_example

* Sample

#+name: wire
#+begin_example
---------- MODULE wire --------
EXTENDS Integers
(*--algorithm wire
variables
  people = {"alice", "bob"},
  acc = [p \in people |-> 5],

define
  NoOverdrafts == \A p \in people: acc[p] >= 0
  EventuallyConsistent == <>[](acc["alice"] + acc["bob"] = 10)
end define;

process Wire \in 1..2
  variables
    sender = "alice",
    receiver = "bob",
    amount \in 1..acc[sender];

  begin
    CheckAndWithdraw:
      if amount <= acc[sender] then
        acc[sender] := acc[sender] - amount;
        Deposit:
          acc[receiver] := acc[receiver] + amount;
      end if;
end process;
end algorithm;*)
===============================
#+end_example

These tools seem to have a fair amount of file conventions that
inhibits use of things like stdin.

* translate

#+begin_src shell
  . ${venv}/bin/activate
  tlacli translate --help
#+end_src

#+RESULTS:
#+begin_example
(tla) org_babel_sh_prompt> venv='/tmp/tla'
(tla) org_babel_sh_prompt> . ${venv}/bin/activate
(tla) org_babel_sh_prompt> tlacli translate --help
/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename
usage: tlacli translate [-h] Specfile

positional arguments:
  Specfile    The specfile.tla

options:
  -h, --help  show this help message and exit
(tla) org_babel_sh_prompt> [?2004hecho 'ob_comint_async_shell_end_250302b9-54c0-409a-9490-2b996fa09e89'[?2004l
#+end_example

** Example

#+begin_src shell :stdin wire :dir venv
  cat > wire.tla
  . ${venv}/bin/activate
  tlacli translate wire.tla
  cat wire.tla
#+end_src

#+RESULTS:
#+begin_example
/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename

pcal.trans Version 1.9 of 10 July 2019
Parsing completed.
Translation completed.
New file wire.tla written.

---------- MODULE wire --------
EXTENDS Integers
(*--algorithm wire
variables
  people = {"alice", "bob"},
  acc = [p \in people |-> 5],

define
  NoOverdrafts == \A p \in people: acc[p] >= 0
  EventuallyConsistent == <>[](acc["alice"] + acc["bob"] = 10)
end define;

process Wire \in 1..2
  variables
    sender = "alice",
    receiver = "bob",
    amount \in 1..acc[sender];

  begin
    CheckAndWithdraw:
      if amount <= acc[sender] then
        acc[sender] := acc[sender] - amount;
        Deposit:
          acc[receiver] := acc[receiver] + amount;
      end if;
end process;
end algorithm;*)
\* BEGIN TRANSLATION - the hash of the PCal code: PCal-5e6935c344a1a656bfb663d98f66f43e
VARIABLES people, acc, pc

(* define statement *)
NoOverdrafts == \A p \in people: acc[p] >= 0
EventuallyConsistent == <>[](acc["alice"] + acc["bob"] = 10)

VARIABLES sender, receiver, amount

vars == << people, acc, pc, sender, receiver, amount >>

ProcSet == (1..2)

Init == (* Global variables *)
        /\ people = {"alice", "bob"}
        /\ acc = [p \in people |-> 5]
        (* Process Wire *)
        /\ sender = [self \in 1..2 |-> "alice"]
        /\ receiver = [self \in 1..2 |-> "bob"]
        /\ amount \in [1..2 -> 1..acc[sender[CHOOSE self \in  1..2 : TRUE]]]
        /\ pc = [self \in ProcSet |-> "CheckAndWithdraw"]

CheckAndWithdraw(self) == /\ pc[self] = "CheckAndWithdraw"
                          /\ IF amount[self] <= acc[sender[self]]
                                THEN /\ acc' = [acc EXCEPT ![sender[self]] = acc[sender[self]] - amount[self]]
                                     /\ pc' = [pc EXCEPT ![self] = "Deposit"]
                                ELSE /\ pc' = [pc EXCEPT ![self] = "Done"]
                                     /\ acc' = acc
                          /\ UNCHANGED << people, sender, receiver, amount >>

Deposit(self) == /\ pc[self] = "Deposit"
                 /\ acc' = [acc EXCEPT ![receiver[self]] = acc[receiver[self]] + amount[self]]
                 /\ pc' = [pc EXCEPT ![self] = "Done"]
                 /\ UNCHANGED << people, sender, receiver, amount >>

Wire(self) == CheckAndWithdraw(self) \/ Deposit(self)

(* Allow infinite stuttering to prevent deadlock on termination. *)
Terminating == /\ \A self \in ProcSet: pc[self] = "Done"
               /\ UNCHANGED vars

Next == (\E self \in 1..2: Wire(self))
           \/ Terminating

Spec == Init /\ [][Next]_vars

Termination == <>(\A self \in ProcSet: pc[self] = "Done")

\* END TRANSLATION - the hash of the generated TLA code (remove to silence divergence warnings): TLA-d8221abe569b4420e0c121ea32301dbc
===============================
#+end_example

* check

** Help

#+begin_src shell
  . ${venv}/bin/activate
  tlacli check --help
#+end_src

#+RESULTS:
#+begin_example
(tla) org_babel_sh_prompt> venv='/tmp/tla'
(tla) org_babel_sh_prompt> . ${venv}/bin/activate
(tla) org_babel_sh_prompt> tlacli check --help
/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename
usage: tlacli check [-h] [--spec SPEC] [--cfg CFG] [--invariant [INVARIANT ...]] [--property [PROPERTY ...]]
                    [--constant CONSTANT CONSTANT] [--model-values MODEL_VALUES [MODEL_VALUES ...]]
                    [--cfg-out CFG_OUT] [--tlc-workers TLC_WORKERS]
                    Specfile

positional arguments:
  Specfile              The specfile.tla

options:
  -h, --help            show this help message and exit
  --cfg-out CFG_OUT     Where to save the cfg file, if you want to reuse it

cfg_args:
  Configuration values for the TLA+ spec

  --spec, --specification SPEC
                        The TLA+ specification operator, defaults to Spec
  --cfg CFG             A template cfg for default values
  --invariant [INVARIANT ...]
                        Adds argument as model invariant, may be specified multiple times
  --property [PROPERTY ...]
                        Adds argument as model temporal property, may be specified multiple times
  --constant CONSTANT CONSTANT
                        {name} {value}
  --model-values MODEL_VALUES [MODEL_VALUES ...]
                        list of model values

tlc_args:
  Runtime values for the TLC model checker

  --tlc-workers TLC_WORKERS
                        The number of worker threads to use (default is number of cpus)
(tla) org_babel_sh_prompt> [?2004hecho 'ob_comint_async_shell_end_4fa60f4f-dab9-453a-b319-a699235bcfc8'[?2004l
#+end_example

** Example

#+begin_src shell :stdin wire :dir venv
  cat > wire.tla
  . ${venv}/bin/activate
  tlacli translate wire
  tlacli check --invariant NoOverdrafts --property EventuallyConsistent -- wire.tla
#+end_src

#+RESULTS:
#+begin_example
/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename

pcal.trans Version 1.9 of 10 July 2019
Parsing completed.
Translation completed.
New file wire.tla written.

/private/tmp/tla/lib/python3.14/site-packages/tlacli/tools/tlc.py:9: UserWarning: pkg_resources is deprecated as an API. See https://setuptools.pypa.io/en/latest/pkg_resources.html. The pkg_resources package is slated for removal as early as 2025-11-30. Refrain from using this package or pin to Setuptools<81.
  from pkg_resources import resource_filename

TLC2 Version 2.15 of Day Month 20?? (rev: d5b5a7f)
Warning: Please run the Java VM which executes TLC with a throughput optimized garbage collector by passing the "-XX:+UseParallelGC" property.
(Use the -nowarning option to disable this warning.)
Running breadth-first search Model-Checking with fp 81 and seed -1207125797809253853 with 10 workers on 10 cores with 8192MB heap and 64MB offheap memory [pid: 27902] (Mac OS X 26.3.1 aarch64, Homebrew 21.0.11 x86_64, MSBDiskFPSet, DiskStateQueue).
Parsing file /Users/mwhipple/memex/wire.tla
Parsing file /private/var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/Integers.tla
Parsing file /private/var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/Naturals.tla
Semantic processing of module Naturals
Semantic processing of module Integers
Semantic processing of module wire
Starting... (2026-06-22 12:32:20)
Implied-temporal checking--satisfiability problem has 1 branches.
Computing initial states...
Computed 2 initial states...
Computed 4 initial states...
Computed 8 initial states...
Computed 16 initial states...
Finished computing initial states: 25 distinct states generated at 2026-06-22 12:32:26.
Progress(5) at 2026-06-22 12:32:26: 332 states generated, 222 distinct states found, 0 states left on queue.
Checking temporal properties for the complete state space with 222 total distinct states at (2026-06-22 12:32:26)
Error: Temporal properties were violated.

Error: The following behavior constitutes a counter-example:

State 1: <Initial predicate>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 5, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"CheckAndWithdraw", "CheckAndWithdraw">>

State 2: <CheckAndWithdraw line 50, col 27 to line 56, col 77 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 4, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "CheckAndWithdraw">>

State 3: <CheckAndWithdraw line 50, col 27 to line 56, col 77 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 3, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "Deposit">>

State 4: <Deposit line 58, col 18 to line 61, col 68 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 3, bob |-> 6]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "Done">>

State 5: Stuttering
Finished checking temporal properties in 00s at 2026-06-22 12:32:26
332 states generated, 222 distinct states found, 0 states left on queue.
Finished in 05s at (2026-06-22 12:32:26)

#+end_example

* Rendering

There seems to be some built-in DOT rendering somewhere upstream that
should act as the starting point. This is likely another reason to
pull in the CLI code for local extension.

* Usage

** Module Definition

4 is the magic number on either side.
The name must match the file.

#+begin_src tla
---- MODULE <name> ----
=======================
#+end_src

** \* ([[id:5C4EB373-6300-460B-A882-A8A2D72259CD][is-a-single-line-comment]])

** (*-- *) ([[id:A0D7C6C3-F0E8-4362-AA6F-54BF6FF5A422][is-a-block-comment]])

** EXTENDS ([[id:0E93C501-C02F-43A4-8AC8-7337DF071706][is-an-import]])

** PlusCal algorithm block

As block comment...
(*--algorithm <name>
...
end algorithm;*)

** Operations

*** + Addition
*** - Subtraction

*** comparison

*** := assignment                                                   :pluscal:

**** <=

**** >=

**** =

*** .. range

inclusive

*** \in

members of set - will be used for complete coverage when assigned

** Block types

*** <labelname>: ...

Define an atomic set of actions within a concurrent process.

*** begin
define an algorithm implementation

*** define ... end define;

*** macro name(<parameter>) begin <body> end macro;                 :pluscal:
There's no thing in the way of hygienic isolation or lexical scoping
so this is presumably just simple expansion.

*** process <name> \in <set> .. end process;                        :pluscal:

*** variables ([[id:48C2CB7A-35F2-40A8-A430-F6F69B2C6F02][is-a-variable-definition]])

variables
  <identifier> <operator> <expression>,
  ...

** Connectives

*** /\ And

** Data Types

*** {,} ([[id:F90CA648-D9E8-4481-A639-3303AFBABEB4][is-a-set]])

**** \X (cross) cartesian product

*** "..." ([[id:3E70CDD5-BB1F-49FF-869D-97E6E7E5309E][is-a-string]])

*** <<, >> sequences ([[id:5505D043-68CB-4DC5-8476-531E2FB07E96][is-a-list]])

**** <updated> = Append(<list>,<element);
Sequences?

*** functions

Functions in TLA+ unsurprisingly have a very mathematical bent where
they can be largely viewed as relations where the range may be
optionally calculated from the inputs.

**** definitions: [<param> \in <domain> |-> <result>] ([[id:B2A0D090-5BDE-42A5-B6C3-C0EC260A9498][is-a-function-defintion]])

**** invocation: name[key]

**** structures: [<key> |-> <value>, ....]

**** set of structures: [key: {<set>},...]

*** integer literal ([[id:10AE2978-0597-4BFA-A265-49173C8C810A][is-an-integer]])

*** operator: <identifier> == <expression>

** Expressions

*** IF <test> THEN <on-true> ELSE <on-false>

TLA+ provides an if expression whereas pluscal provides a statement.

*** Quantifiers

**** \A <id> \in <set>: <assertion>

Universal quantifier

**** <>[](<expression>) eventually always


Here I'll start to pull apart tlacli for extensibility.

** Impressions

The existing code is understandably very oriented towards CLI
interactions, so one theme will likely be extract the model.

** First Step

The initial initial entrypoint actually starts from a command parsing
perspective, so instead the function will be pulled out so that it can
be invoked programmatically (and then wired to argparse).

** cfg files

As somewhat known during adoption, a major piece this library brings
is configuration file management.

This may ultimately be the sole piece that's worth keeping around.
The upstream logic doesn't feel paricularly cohesive so this will try
to it a bit more.

This is focused on the cfg files themselves which are part of, but not the
entire configuration story.

It seems to make the most sense to define the skeletal template and
then fill in the details for the different properties.

#+begin_src python :noweb yes :tangle /tmp/tlacfg.py
  from dataclasses import dataclass, field
  <<imports>>

  @dataclass
  class CfgFile:
      <<cfg_properties>>

      <<cfg_methods>>

#+end_src

#+RESULTS:

*** Methods
:PROPERTIES:
:header-args: :noweb-ref cfg_methods
:END:

**** merge

Merge to CfgFiles to produce a third of that combination.  dict keys
will be overridden (which means this can't be treated as addition).

#+begin_src python :noweb yes
  def merge(self, other: CfgFile) -> CfgFile:
      merged = CfgFile()
      <<cfg_merge_properties>>
      return merged
#+end_src

#+RESULTS:
: None

**** render

Render model as cfg file for tlc.

Each property renderer should append lines to ~out~.

#+begin_src python :noweb yes
  def render(self) -> str:
      out = []
      <<cfg_render_properties>>
      return "\n".join(out)

#+end_src

**** write

Write rendered cfg to provided file.

#+begin_src python
  def write(self, file: str):
      with open(file, 'w') as f:
          f.write(self.render())
#+end_src

*** Properties

**** specification

The associated spec.

***** Definition

#+begin_src python :noweb-ref cfg_properties
  specification: str = "Spec"
#+end_src

***** render

#+begin_src python :noweb-ref cfg_render_properties
  out.append(f"SPECIFICATION {self.specification}")
#+end_src

**** invariants

Define those invariants that will be verified.

***** Definition

#+begin_src python :noweb-ref cfg_properties
  invariants: ss = field(default_factory=set)
#+end_src

***** merge

#+begin_src python :noweb-ref cfg_merge_properties
  merged.invariants = self.invariants | other.invariants
#+end_src

***** render

#+begin_src python :noweb-ref cfg_render_properties
  out += [f"INVARIANT {i}" for i in sorted(self.invariants)]
#+end_src

**** properties

Define temporaral properties.

***** Definition

#+begin_src python :noweb-ref cfg_properties
  properties: ss = field(default_factory=set)
#+end_src

***** merge

#+begin_src python :noweb-ref cfg_merge_properties
  merged.properties = self.properties | other.properties
#+end_src

***** render

#+begin_src python :noweb-ref cfg_render_properties
  out += [f"PROPERTY {p}" for p in sorted(self.properties)]
#+end_src

**** constants

Haven't learned this yet.

***** Definition

#+begin_src python :noweb-ref cfg_properties
  constants: t.Dict[str, str] = field(default_factory=dict)
#+end_src

***** merge

Newer versions of python support pipe dict merging.

#+begin_src python :noweb-ref cfg_merge_properties
  merged.constants = self.constants | other.constants
#+end_src

***** render

Upstream constants come after model values but I'll optimistically
think it's insignificant. Otherwise the definitions could simply be
reordered (but the requirement should be more clearly captured).

#+begin_src python :noweb-ref cfg_render_properties
  if self.constants:
      out.append(r"CONSTANTS \* regular assignments")
      out.extend([f"  {c} = {v}" for c,v in self.constants.items()])
#+end_src

**** model_values

Han't learned this yet neither.

***** Definition

#+begin_src python :noweb-ref cfg_properties
  model_values: ss = field(default_factory=set)
#+end_src

***** merge

#+begin_src python :noweb-ref cfg_merge_properties
  merged.model_values = self.model_values | other.model_values
#+end_src

#+RESULTS:
: 38dc8482-e8e7-4bbb-920f-0aff12fe2404

***** render

#+begin_src python :noweb-ref cfg_render_properties
  if self.model_values:
      out.append("\nCONSTANTS \\* model values")
      out.extend([f"  {m} = {m}" for m in sorted(self.model_values)])
#+end_src

*** Sandbox
#+begin_src python
  cfg = (CfgFile(
      invariants={"foo", "baz"},
      properties={1},
      constants={'a': 1, 'b': 2},
      model_values={"blah blah"},
  ).merge(
      CfgFile(
          invariants={"foo", "bar"},
          properties={2},
          constants={'a': 3, 'c': 3}
      )
  ))
  print(cfg.render())
  cfg.write('/tmp/foo.cfg')
#+end_src

#+RESULTS:
#+begin_example
SPECIFICATION Spec
INVARIANT bar
INVARIANT baz
INVARIANT foo
PROPERTY 1
PROPERTY 2
CONSTANTS \* regular assignments
  a = 3
  b = 2
  c = 3

CONSTANTS \* model values
  blah blah = blah blah
#+end_example

*** Interim Wrap-Up

The resulting logic is minimally different than what was upstream.
There's also parsing logic in the original file along with support
for a defaults file, but for now that will just be deferred.

If that gets pulled in, I'd probably add a new parsing method and
handle the merging in an extracted argument parser. The merging logic
currently here is therefore unused.

This implementation currently commingles the [[id:3B8BCBF8-8E95-4D00-A9B3-18235E512D76][serde]] concerns with the
data both to reduce the weight, and also as a reflection of the fact
that there is a strong association between the data elements and the
specific file.

** TLC

*** Environment

The logic does require some environmental parameters so we'll
introduce a class to close over those.

#+begin_src python :noweb yes
  from dataclasses import dataclass, field
  <<tla_imports>>

  @dataclass
  class TLA:
        jar_path: str

        <<tla_methods>>

  <<tla_functions>>
#+end_src

#+RESULTS:

The path to the jar should be extracted somehow or others.

A fair amount of this revolves around constructing the script command,
so that will be split out.

**** call

Handle some of the subprocess boilerplate.

#+begin_src python :noweb-ref tla_methods
  def call(self, command):
      with TemporaryDirectory() as start_dir:
          result = subprocess.run(f"java -jar {self.jar_path} {command}", text=True, capture_output=True, shell=True)
          print(result.stderr)
          print(result.stdout)

#+end_src

**** Invoking TLC

For the most part execution itself will just involve composing the
command and relying on files to be present, but to support
programmatic access it seems like actually creating the files is the
right boundary.

***** Imports

#+begin_src python :noweb-ref tla_imports
  from pathlib import Path
  import os
  import subprocess
  import uuid
  from tempfile import TemporaryDirectory # For state cleanup
#+end_src

***** Body

#+begin_src python :noweb-ref tla_methods
  def tlc(self, spec: str, cfg: CfgFile, cfg_file="tlacli.cfg", **kwargs):
      os.chdir(Path(spec).parent)
      cfg.write(cfg_file)
      self.call(f"-metadir {state_dir} -config {cfg_file} -workers=1 -terse -cleanup {spec}")
#+end_src

#+RESULTS:

**** Functions

There is existing logic to find the jar, that could be carried forward
as a factory method.

This overall doesn't seem worthwhile. It's not going to be a
self-contained package without java, and if we wanted to include that
we'd be better off building an image which could then likely use
something like an environment variable.

#+RESULTS:

** Usage

*** Help

#+begin_src python
  tla = TLA(jar_path="~/memex/vendor/tlacli/src/tlacli/tla2tools.jar")
  tla.call("-help")
#+end_src

#+RESULTS:
#+begin_example
TLC2 Version 2.15 of Day Month 20?? (rev: d5b5a7f)
The model checker (TLC) provides the functionalities of model
checking or simulation of TLA+ specifications. The syntax for this command is:

java tlc2.TLC [GENERAL-SWITCHES] [MODE-SWITCHES] SPEC

where SPEC is the name of the specification's root module
and the optional GENERAL-SWITCHES are:
-checkpoint num: interval between check point (in minutes)
	Defaults 30 if not provided.
-cleanup: clean up the states directory
-config file: provide the config file.
	Defaults to SPEC.cfg if not provided
-continue: continue running even when invariant is violated
	Defaults to stop at the first violation if not specified
-coverage minutes: interval between collection of coverage information 
	on the spec in minutes. Defaults to no coverage if not specified
-deadlock: do not check for deadlock.
	Defaults to check deadlock if not specified
-difftrace: show only the differences between successive states,
	when printing trace. Defaults to print full state descriptions
-debug: debugging information (not for production use)
-dump file: dump all the states into file
-fp num: use the num'th irreducible polynomial from the list 
	stored in the class FP64.
-gzip: control if gzip is applied to value input/output stream.
	Defaults to off if not specified
-metadir path: store metadata in the directory at path
	Defaults to SPEC-directory/states if not specified
-recover id: recover from the checkpoint with id
	Defaults to scratch run if not specified
-terse: do not expand values in Print statement
	Defaults to expand value if not specified
-tool: tool mode (put message codes on console)
-nowarning: disable all the warnings.
	Defaults to report warnings if not specified
-workers num: the number of TLC worker threads. Defaults to 1.

By default, TLC starts in the model checking mode using breadth-first
approach for the state space exploration. This can be changed using
the MODE-SWITCHES. In contrast to the GENERAL-SWITCHES these can be used 
if applied in certain combinations only:

{[-dfid num][ -view]|-simulate[ -depth num][ -aril num][ -seed num]}

-modelcheck: run in model checking mode using breadth-first approach for the
	state space exploration (default)
-dfid num: run in model checking mode and use depth-first iterative deepening
	with initial depth num
-view: apply VIEW (if provided) when printing out states.
-simulate: run in simulation mode
-depth num: specify the depth of random simulation
	Defaults to 100 if not specified
-seed num: provide the seed for random simulation
	Defaults to a random seed if not specified)
-aril num: Adjust the seed for random simulation
	Defaults to 0 if not specified
#+end_example

*** With Config

There's config generation using mustache in emacs-lisp which will be
pulled in here: as a result the class will go away and be replaced
with a general object.

#+begin_src python :dir /tmp/tla
  tla = TLA(jar_path="~/memex/vendor/tlacli/src/tlacli/tla2tools.jar")
  cfg_file='test.cfg'
  CfgFile(specification="Spec", invariants=["NoOverdrafts"], properties=["EventuallyConsistent"]).write(cfg_file)
  tla.call(f'-config {cfg_file} wire.tla')
#+end_src

#+RESULTS:
#+begin_example
TLC2 Version 2.15 of Day Month 20?? (rev: d5b5a7f)
Warning: Please run the Java VM which executes TLC with a throughput optimized garbage collector by passing the "-XX:+UseParallelGC" property.
(Use the -nowarning option to disable this warning.)
Running breadth-first search Model-Checking with fp 113 and seed 8355106431381112692 with 1 worker on 10 cores with 8192MB heap and 64MB offheap memory [pid: 63366] (Mac OS X 26.3.1 aarch64, Homebrew 21.0.11 x86_64, MSBDiskFPSet, DiskStateQueue).
Parsing file /private/tmp/tla/wire.tla
Parsing file /private/var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/Integers.tla
Parsing file /private/var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/Naturals.tla
Semantic processing of module Naturals
Semantic processing of module Integers
Semantic processing of module wire
Starting... (2026-06-22 20:49:17)
Implied-temporal checking--satisfiability problem has 1 branches.
Computing initial states...
Computed 2 initial states...
Computed 4 initial states...
Computed 8 initial states...
Computed 16 initial states...
Finished computing initial states: 25 distinct states generated at 2026-06-22 20:49:17.
Progress(5) at 2026-06-22 20:49:17: 332 states generated, 222 distinct states found, 0 states left on queue.
Checking temporal properties for the complete state space with 222 total distinct states at (2026-06-22 20:49:17)
Error: Temporal properties were violated.

Error: The following behavior constitutes a counter-example:

State 1: <Initial predicate>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 5, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"CheckAndWithdraw", "CheckAndWithdraw">>

State 2: <CheckAndWithdraw line 50, col 27 to line 56, col 77 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 4, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "CheckAndWithdraw">>

State 3: <CheckAndWithdraw line 50, col 27 to line 56, col 77 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 3, bob |-> 5]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "Deposit">>

State 4: <Deposit line 58, col 18 to line 61, col 68 of module wire>
/\ people = {"alice", "bob"}
/\ sender = <<"alice", "alice">>
/\ receiver = <<"bob", "bob">>
/\ acc = [alice |-> 3, bob |-> 6]
/\ amount = <<1, 1>>
/\ pc = <<"Deposit", "Done">>

State 5: Stuttering
Finished checking temporal properties in 00s at 2026-06-22 20:49:17
332 states generated, 222 distinct states found, 0 states left on queue.
Finished in 00s at (2026-06-22 20:49:17)
#+end_example

*** Issues

**** Can't open config file

#+begin_example
The exception was a tlc2.tool.ConfigFileException
: TLC encountered the following error when trying to read the configuration file /var/folders/y1/qpq5h9vd44dgw77dx8jb00380000gn/T/tmpix5enxh2/tla.cfg:
File not found.
#+end_example

The file certainly seems to exist based on other code added around there.

The comments in the upstream code seem relvant
# We don't use the temporary module because it closes the file when we're done, and we need to pass a filepath into tlc.
# BUG: fails if passing in an absolute path (raised)

Changing to random files in /tmp that can be verified, but that still
doesn't seem to make a difference.

That could be the absolute path issue apparently.

I suspect that most of the issue comes down to the fragility in the
standard setup that I'm now slamming into since I'm using it in less
conventional ways - let me make sure I'm in the directory of the spec.

That seems to be the case as changing the working directory addressed
it. A particularly robust solution (supporting absolute paths) would
likely require changes in TLA, so I'll plan on just a basic mix of
DWIMmery and feedback as I stub my toes.

**** Config file issues

The SPECIFICATION block in the config file is required, if it is
absent then TLC will throw a lower level error (I don't have the
specific error, but something about Java barfing on a string value).

This feels worth wrapping in better handling if it recurs.
* Resources
** TODO https://github.com/Apress/practical-tla-plus
** TODO https://lamport.azurewebsites.net/tla/book-21-07-04.pdf
** TODO https://www.learntla.com/
